In [1]:
# CAPSTONE PROJECT

In [31]:
# A.PHASE 1 - DATA INGESTION AND CLEANING

In [3]:
import pandas as pd

In [4]:
# 1. LOAD CSV FILE

In [5]:
df = pd.read_csv("raw_sales_data.csv")

In [6]:
# 2. INSPECT DATASET

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10500 entries, 0 to 10499
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       10500 non-null  int64
 1   order_date     10500 non-null  object
 2   customer_id    10500 non-null  object
 3   customer_name  9648 non-null   object
 4   product        10500 non-null  object
 5   category       10500 non-null  object
 6   quantity       10500 non-null  int64
 7   unit_price     10500 non-null  int64
 8   country        10500 non-null  object
 9   created_at     10500 non-null  object
dtypes: int64(3), object(7)
memory usage: 820.4+ KB

In [8]:
df.head(5)

,order_id,order_date,customer_id,customer_name,product,category,quantity,unit_price,country,created_at
0,1000,2024-02-10,C126,Arthur Bowen,Laptop,Electronics,5,850,UK,2025-11-01 22:24:47
1,1001,07/02/2024,C112,Jason Smith,Laptop,Electronics,5,850,France,2025-12-07 08:03:32
2,1002,15/01/2024,C446,NaN,Vacuum Cleaner,Home Appliances,3,250,China,2025-11-18 22:42:05
3,1003,2024-01-10,C048,Jennifer Romero,Air Conditioner,Home Appliances,3,1500,USA,2025-12-01 21:28:40
4,1004,16/02/2024,C473,Amy Phelps,Microwave,Home Appliances,5,300,UAE,2025-11-15 19:15:55

In [9]:
df.tail(5)

,order_id,order_date,customer_id,customer_name,product,category,quantity,unit_price,country,created_at
10495,6170,20/02/2024,C292,Diana Mendoza,Laptop,electronics,4,850,China,2025-11-04 05:02:01
10496,8205,2024-01-22,C105,Laura King,Toaster,home appliances,2,40,India,2025-11-09 11:11:23
10497,3522,04/01/2024,C457,Henry Shannon,Laptop,Electronics,3,850,UK,2025-12-19 01:38:04
10498,3215,2024-01-30,C284,Hannah Jones,Camera,Electronics,2,650,China,2025-12-18 22:59:27
10499,7968,19/01/2024,C060,Tina Thompson,Laptop,Electronics,5,850,Nigeria,2025-12-09 13:54:17

In [11]:
# 3. IDENTIFY AND REMOVE DUPLICATES

In [12]:
df["order_id"].duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
10495     True
10496     True
10497     True
10498     True
10499     True
Name: order_id, Length: 10500, dtype: bool

In [13]:
df = df.drop_duplicates(subset=["order_id"], keep="first")

In [14]:
#. STANDARDIZE TEXT COLUMNS

In [17]:
# Select all text (object) columns
text_cols = df.select_dtypes(include="object").columns
# Trim leading & trailing spaces
df[text_cols] = df[text_cols].apply(lambda col: col.str.strip())

In [18]:
# Apply consistent casing
df["customer_name"] = df["customer_name"].str.title()
df["category"] = df["category"].str.title()
df["country"] = df["country"].str.upper()

In [19]:
# 5. CONVERT ALL DATES TO STANDARD YYYY-MM-DD FORMAT

In [20]:
date_cols = ["order_date", "created_at"]

for col in date_cols:
    df[col] = pd.to_datetime(df[col], errors="coerce")
    df[col] = df[col].dt.strftime("%Y-%m-%d")

In [21]:
# 6. HANDLE MISSING VALUES

In [22]:
#Count of missing values
df.isna().sum()

order_id            0
order_date       4890
customer_id         0
customer_name     795
product             0
category            0
quantity            0
unit_price          0
country             0
created_at          0
dtype: int64

In [25]:
#filling missing order_date with created_at
df["order_date"] = df["order_date"].fillna(df["created_at"])

#filling customer_name with default
df["customer_name"] = df["customer_name"].fillna("Unknown")

In [26]:
# Verify that all missing values handled
df.isna().sum()

order_id         0
order_date       0
customer_id      0
customer_name    0
product          0
category         0
quantity         0
unit_price       0
country          0
created_at       0
dtype: int64

In [ ]:
# VERIFY DATA CLEANING

In [27]:
df.head(5)

,order_id,order_date,customer_id,customer_name,product,category,quantity,unit_price,country,created_at
0,1000,2024-02-10,C126,Arthur Bowen,Laptop,Electronics,5,850,UK,2025-11-01
1,1001,2025-12-07,C112,Jason Smith,Laptop,Electronics,5,850,FRANCE,2025-12-07
2,1002,2025-11-18,C446,Unknown,Vacuum Cleaner,Home Appliances,3,250,CHINA,2025-11-18
3,1003,2024-01-10,C048,Jennifer Romero,Air Conditioner,Home Appliances,3,1500,USA,2025-12-01
4,1004,2025-11-15,C473,Amy Phelps,Microwave,Home Appliances,5,300,UAE,2025-11-15

In [28]:
df.tail(5)

,order_id,order_date,customer_id,customer_name,product,category,quantity,unit_price,country,created_at
9995,10995,2025-11-14,C394,Heather Cook,Toaster,Home Appliances,1,40,SOUTH KOREA,2025-11-14
9996,10996,2024-02-02,C227,Rita Hayes Md,Smartwatch,Electronics,5,200,SOUTH KOREA,2025-11-18
9997,10997,2024-02-06,C365,Alexander Hill,Smartphone,Electronics,5,500,MEXICO,2025-12-20
9998,10998,2024-01-31,C345,Unknown,Smartphone,Electronics,1,500,UAE,2025-11-23
9999,10999,2024-01-09,C365,Patricia Jones,Smartwatch,Electronics,5,200,UK,2025-12-05

In [34]:
# 7. SAVE CLEAN DATA

In [35]:
# Save cleaned data
df.to_csv("clean_sales_data.csv", index=False)

print("Cleaned data saved successfully!")

Cleaned data saved successfully!

In [32]:
# B. PHASE 2 - LOAD DATA INTO DATABASE

In [36]:
# 8. CREATED DATABASE USING PostgreSQL named "sales_db"

In [37]:
# 9. LOAD CLEANED CSV INTO DATABASE

In [38]:
from sqlalchemy import create_engine

engine = create_engine(
    "postgresql+psycopg2://postgres:%40Dsa2024@localhost:5432/sales_db"
)

In [39]:
#check connection
with engine.connect() as conn:
    print("Connected successfully!")

Connected successfully!

In [40]:
#load clean data into database
df.to_sql(
    "sales_db",
    engine,
    if_exists="replace",
    index=False
)

807

In [41]:
# 10. RECORDS INSERTED